sauloverissimo/midi2_cpp/examples/ump-test-bench-rp2040/src/catalog.cpp
/*
 * catalog.cpp, deterministic UMP catalog (101 entries).
 *
 * Each entry follows the same shape:
 *   1. issue the midi.sendXxx() call (or rp2040_midi2::pumpRaw for the
 *      five entries that have no midi2_cpp sender: Endpoint Discovery,
 *      Stream Config Request, FB Discovery, plus the two intentional
 *      edge cases),
 *   2. capture the same wire bytes via the corresponding midi2 C99
 *      midi2_msg_xxx builder, padded to 4 words for log alignment,
 *   3. emit one EMIT line per UMP packet (matching what reaches the
 *      USB bus byte-for-byte).
 *
 * EMIT line format (matches §8 of the spec doc):
 *
 *   EMIT idx=##  label=<descriptor>  words=W0 W1 W2 W3
 *
 * Words are 8 hex digits uppercase, space-separated; entries that emit
 * fewer than 4 real words pad the trailing slots with 00000000 so the
 * line width stays constant. Multi-packet entries print one EMIT line
 * per UMP packet, each tagged with the same idx.
 *
 * The chord_type codes used in the bench (0x01 Major, 0x03 Major 7,
 * 0x07 Minor) are the values the midi2 C99 inline doc records. Other
 * chord types in §5.1 (Dm7, G7, F#dim, CMaj7/E) are best-effort with
 * the closest available code plus alterations; M2-104 Table 14 should
 * be consulted on the host side to verify.
 */
#include "catalog.h"
#include "rp2040_midi2.h"

#include <cstdio>
#include <cstring>

#include "pico/stdlib.h"
#include "pico/time.h"

namespace ump_test_bench {

namespace {

constexpr uint8_t kCatalogGroup   = 0;
constexpr uint8_t kCatalogChannel = 0;

void log_words(uint8_t idx, const char* label, const uint32_t* w, uint8_t n_words) {
    uint32_t pad[4] = {0, 0, 0, 0};
    if (n_words > 4) n_words = 4;
    for (uint8_t i = 0; i < n_words; ++i) pad[i] = w[i];
    std::printf("EMIT idx=%02u  label=%-44s  words=%08X %08X %08X %08X\r\n",
                (unsigned)idx, label,
                (unsigned)pad[0], (unsigned)pad[1], (unsigned)pad[2], (unsigned)pad[3]);
}

void log_word1(uint8_t idx, const char* label, uint32_t w0) {
    std::printf("EMIT idx=%02u  label=%-44s  words=%08X 00000000 00000000 00000000\r\n",
                (unsigned)idx, label, (unsigned)w0);
}

uint32_t bpm_to_ten_ns(uint32_t bpm) {
    return 6000000000u / bpm;
}

/*--------------------------------------------------------------------+
 * §5.1 Flex Data bank 0x00 (Setup and Performance), idx 0..18
 *--------------------------------------------------------------------*/

void emit_set_tempo(uint8_t idx, midi2::m2device& midi, uint32_t bpm, const char* label) {
    const uint32_t ten_ns = bpm_to_ten_ns(bpm);
    midi.sendTempo(kCatalogGroup, ten_ns);
    uint32_t w[4]; midi2_msg_tempo(w, kCatalogGroup, ten_ns);
    log_words(idx, label, w, 4);
}

void emit_set_time_sig(uint8_t idx, midi2::m2device& midi,
                       uint8_t num, uint8_t denom, const char* label) {
    midi.sendTimeSignature(kCatalogGroup, num, denom);
    uint32_t w[4]; midi2_msg_time_sig(w, kCatalogGroup, num, denom);
    log_words(idx, label, w, 4);
}

void emit_set_key_sig(uint8_t idx, midi2::m2device& midi,
                      int8_t sf, bool minor, const char* label) {
    midi.sendKeySignature(kCatalogGroup, sf, minor);
    uint32_t w[4]; midi2_msg_key_sig(w, kCatalogGroup, sf, minor);
    log_words(idx, label, w, 4);
}

void emit_set_chord(uint8_t idx, midi2::m2device& midi,
                    const midi2::ChordDescriptor& c, const char* label) {
    midi.sendChordName(kCatalogGroup, c);
    uint32_t w[4];
    midi2_msg_chord_name(w, kCatalogGroup, c.address, c.channel,
                          c.tonicSharpFlat, c.tonicNote, c.chordType,
                          c.alt1Type, c.alt1Degree,
                          c.alt2Type, c.alt2Degree,
                          c.alt3Type, c.alt3Degree,
                          c.alt4Type, c.alt4Degree,
                          c.bassSharpFlat, c.bassNote, c.bassChordType,
                          c.bassAlt1Type, c.bassAlt1Degree,
                          c.bassAlt2Type, c.bassAlt2Degree);
    log_words(idx, label, w, 4);
}

midi2::ChordDescriptor make_chord(uint8_t tonicNote, uint8_t chordType,
                                   uint8_t bassNote = 0, uint8_t bassType = 0) {
    midi2::ChordDescriptor c{};
    c.address        = 0x01;  // group-level
    c.channel        = 0;
    c.tonicSharpFlat = 0;
    c.tonicNote      = tonicNote;
    c.chordType      = chordType;
    c.bassNote       = bassNote;
    c.bassChordType  = bassType;
    return c;
}

/*--------------------------------------------------------------------+
 * §5.2 / §5.3 Flex Data Text helpers
 *--------------------------------------------------------------------*/

constexpr uint8_t kFlexBankMetadata = 0x01;
constexpr uint8_t kFlexBankPerfText = 0x02;

// Metadata Text (bank 0x01) status codes per midi2 C99 enum names below.
constexpr uint8_t kFlexProjectName       = 0x01;
constexpr uint8_t kFlexCompositionName   = 0x02;
constexpr uint8_t kFlexMidiClipName      = 0x03;
constexpr uint8_t kFlexCopyright         = 0x04;
constexpr uint8_t kFlexComposer          = 0x05;
constexpr uint8_t kFlexLyricist          = 0x06;
constexpr uint8_t kFlexArranger          = 0x07;
constexpr uint8_t kFlexPublisher         = 0x08;
constexpr uint8_t kFlexPrimaryPerformer  = 0x09;

// Performance Text (bank 0x02) status codes.
constexpr uint8_t kFlexLyrics         = 0x01;
constexpr uint8_t kFlexLyricsLanguage = 0x02;
constexpr uint8_t kFlexRuby           = 0x03;
constexpr uint8_t kFlexComment        = 0x05;

void emit_flex_text(uint8_t idx, midi2::m2device& midi,
                    uint8_t bank, uint8_t status,
                    const char* text, const char* label) {
    midi.sendFlexText(kCatalogGroup, bank, status, text);
    // Capture: replay the same text through the C99 builder, fragmenting
    // the same way the wrapper does (12 bytes per UMP, format 0/1/2/3).
    const uint8_t  group   = kCatalogGroup;
    const uint8_t  address = 0x01;     // group-level
    const uint8_t  channel = 0;
    const uint16_t total   = (uint16_t)std::strlen(text);
    const uint8_t* bytes   = (const uint8_t*)text;
    if (total <= 12) {
        uint32_t w[4];
        midi2_msg_flex_text(w, group, /*format*/ 0, address, channel,
                             bank, status, bytes, (uint8_t)total);
        log_words(idx, label, w, 4);
        return;
    }
    uint16_t off = 0;
    while (off < total) {
        uint8_t  chunk = (uint8_t)((total - off) > 12 ? 12 : (total - off));
        uint8_t  format;
        if (off == 0)                         format = 1;  // start
        else if ((off + chunk) >= total)      format = 3;  // end
        else                                  format = 2;  // continue
        uint32_t w[4];
        midi2_msg_flex_text(w, group, format, address, channel,
                             bank, status, bytes + off, chunk);
        log_words(idx, label, w, 4);
        off = (uint16_t)(off + chunk);
    }
}

/*--------------------------------------------------------------------+
 * §5.4 / §5.5 Channel Voice helpers
 *--------------------------------------------------------------------*/

void emit_note_on2(uint8_t idx, midi2::m2device& midi,
                   uint8_t note, uint16_t vel, const char* label) {
    midi.sendNoteOn(kCatalogGroup, kCatalogChannel, note, vel);
    uint32_t w[4]; midi2_msg_note_on(w, kCatalogGroup, kCatalogChannel, note, vel, 0);
    log_words(idx, label, w, 2);
}

void emit_note_off2(uint8_t idx, midi2::m2device& midi,
                    uint8_t note, uint16_t vel, const char* label) {
    midi.sendNoteOff(kCatalogGroup, kCatalogChannel, note, vel);
    uint32_t w[4]; midi2_msg_note_off(w, kCatalogGroup, kCatalogChannel, note, vel, 0);
    log_words(idx, label, w, 2);
}

void emit_cc2(uint8_t idx, midi2::m2device& midi,
              uint8_t cc, uint32_t val, const char* label) {
    midi.sendCC(kCatalogGroup, kCatalogChannel, cc, val);
    uint32_t w[4]; midi2_msg_cc(w, kCatalogGroup, kCatalogChannel, cc, val);
    log_words(idx, label, w, 2);
}

void emit_pitchbend2(uint8_t idx, midi2::m2device& midi,
                     uint32_t val, const char* label) {
    midi.sendPitchBend(kCatalogGroup, kCatalogChannel, val);
    uint32_t w[4]; midi2_msg_pitch_bend(w, kCatalogGroup, kCatalogChannel, val);
    log_words(idx, label, w, 2);
}

/*--------------------------------------------------------------------+
 * §5.6 System helpers (1-word messages)
 *--------------------------------------------------------------------*/

void emit_system_clock(uint8_t idx, midi2::m2device& midi, const char* label) {
    midi.sendClock(kCatalogGroup);
    log_word1(idx, label, midi2_msg_system_timing_clock(kCatalogGroup));
}

/*--------------------------------------------------------------------+
 * §5.7 SysEx7 + SysEx8 helpers
 *--------------------------------------------------------------------*/

void emit_sysex7_one(uint8_t idx, midi2::m2device& midi,
                     uint8_t status_nibble_high, const uint8_t* data, uint8_t len,
                     const char* label) {
    // SysEx7 packet status nibble is in the high nibble of the 8-bit status
    // byte; len lives in the low nibble. midi2_msg_sysex7_packet OR's the
    // two together internally.
    uint32_t w[4] = {0, 0, 0, 0};
    midi2_msg_sysex7_packet(w, kCatalogGroup, status_nibble_high, data, len);
    rp2040_midi2::pumpRaw(w, 2);
    log_words(idx, label, w, 2);
}

void emit_sysex8_one(uint8_t idx, midi2::m2device& midi,
                     uint8_t status_nibble_high, uint8_t stream_id,
                     const uint8_t* data, uint8_t len,
                     const char* label) {
    uint32_t w[4] = {0, 0, 0, 0};
    midi2_msg_sysex8_packet(w, kCatalogGroup, status_nibble_high, stream_id, data, len);
    rp2040_midi2::pumpRaw(w, 4);
    log_words(idx, label, w, 4);
}

/*--------------------------------------------------------------------+
 * §5.8 UMP Stream helpers (4-word messages)
 *--------------------------------------------------------------------*/

void emit_endpoint_name_text(uint8_t idx, const char* text, const char* label) {
    const uint8_t* bytes = (const uint8_t*)text;
    uint16_t       total = (uint16_t)std::strlen(text);
    if (total <= 14) {
        uint32_t w[4];
        midi2_msg_stream_endpoint_name(w, /*format*/ 0, bytes, (uint8_t)total);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        return;
    }
    uint16_t off = 0;
    while (off < total) {
        uint8_t  chunk = (uint8_t)((total - off) > 14 ? 14 : (total - off));
        uint8_t  format = (off == 0) ? 1 : ((off + chunk) >= total ? 3 : 2);
        uint32_t w[4];
        midi2_msg_stream_endpoint_name(w, format, bytes + off, chunk);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        off = (uint16_t)(off + chunk);
    }
}

void emit_product_id_text(uint8_t idx, const char* text, const char* label) {
    const uint8_t* bytes = (const uint8_t*)text;
    uint16_t       total = (uint16_t)std::strlen(text);
    if (total <= 14) {
        uint32_t w[4];
        midi2_msg_stream_product_id(w, /*format*/ 0, bytes, (uint8_t)total);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        return;
    }
    uint16_t off = 0;
    while (off < total) {
        uint8_t  chunk = (uint8_t)((total - off) > 14 ? 14 : (total - off));
        uint8_t  format = (off == 0) ? 1 : ((off + chunk) >= total ? 3 : 2);
        uint32_t w[4];
        midi2_msg_stream_product_id(w, format, bytes + off, chunk);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        off = (uint16_t)(off + chunk);
    }
}

void emit_fb_name_text(uint8_t idx, uint8_t fb_num, const char* text, const char* label) {
    const uint8_t* bytes = (const uint8_t*)text;
    uint16_t       total = (uint16_t)std::strlen(text);
    if (total <= 13) {
        uint32_t w[4];
        midi2_msg_stream_fb_name(w, /*format*/ 0, fb_num, bytes, (uint8_t)total);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        return;
    }
    uint16_t off = 0;
    while (off < total) {
        uint8_t  chunk = (uint8_t)((total - off) > 13 ? 13 : (total - off));
        uint8_t  format = (off == 0) ? 1 : ((off + chunk) >= total ? 3 : 2);
        uint32_t w[4];
        midi2_msg_stream_fb_name(w, format, fb_num, bytes + off, chunk);
        rp2040_midi2::pumpRaw(w, 4);
        log_words(idx, label, w, 4);
        off = (uint16_t)(off + chunk);
    }
}

/*--------------------------------------------------------------------+
 * Identity constants used by §5.8 entries (mirror main.cpp).
 *--------------------------------------------------------------------*/
const uint8_t  kBenchMfrId[3]     = {0x7D, 0x00, 0x00};
const uint16_t kBenchFamily       = 0x0001;
const uint16_t kBenchModel        = 0x0001;
const uint32_t kBenchVersion      = 0x00010000;
const char     kBenchEndpoint[]   = "UMP Reference Emitter";
const char     kBenchProductInst[] = "UMPReferenceEmitter-bench-0001";
const char     kBenchFbName[]     = "Test Bench Group 0";

/*--------------------------------------------------------------------+
 * Stub for not-yet-implemented entries.
 *--------------------------------------------------------------------*/
void emit_stub(uint8_t idx) {
    uint32_t z[4] = {0, 0, 0, 0};
    log_words(idx, "TODO not yet implemented", z, 4);
}

}  // namespace

bool catalogEmit(uint8_t idx, midi2::m2device& midi) {
    if (idx >= kCatalogSize) {
        std::printf("[catalog] idx=%u out of range (max %u)\r\n",
                    (unsigned)idx, (unsigned)(kCatalogSize - 1));
        return false;
    }

    switch (idx) {
        /* ============================================================
         * §5.1 Flex Data 0x00 (Setup and Performance)
         * ============================================================ */
        case 0:  emit_set_tempo(0,  midi, 60,  "set_tempo BPM=60");              break;
        case 1:  emit_set_tempo(1,  midi, 120, "set_tempo BPM=120");             break;
        case 2:  emit_set_tempo(2,  midi, 240, "set_tempo BPM=240");             break;
        case 3:  emit_set_time_sig(3,  midi, 4, 4, "set_time_signature 4/4");    break;
        case 4:  emit_set_time_sig(4,  midi, 3, 4, "set_time_signature 3/4");    break;
        case 5:  emit_set_time_sig(5,  midi, 6, 8, "set_time_signature 6/8");    break;
        case 6:  emit_set_time_sig(6,  midi, 5, 4, "set_time_signature 5/4");    break;
        case 7:  emit_set_time_sig(7,  midi, 7, 8, "set_time_signature 7/8");    break;
        case 8: {
            midi.sendMetronome(kCatalogGroup, /*primary*/ 24, 0, 0, 0, 0, 0);
            uint32_t w[4]; midi2_msg_metronome(w, kCatalogGroup, 24, 0, 0, 0, 0, 0);
            log_words(8, "set_metronome primary=24", w, 4);
        } break;
        case 9:  emit_set_key_sig(9,  midi,  0, false, "set_key_signature C maj");   break;
        case 10: emit_set_key_sig(10, midi,  1, false, "set_key_signature G maj");   break;
        case 11: emit_set_key_sig(11, midi, -1, false, "set_key_signature F maj");   break;
        case 12: emit_set_key_sig(12, midi,  2, true,  "set_key_signature B min");   break;
        case 13: emit_set_key_sig(13, midi,  0, false, "set_key_signature unknown"); break;
        case 14: emit_set_chord(14, midi, make_chord(/*C*/3, /*Maj7*/0x03), "set_chord_name CMaj7"); break;
        case 15: emit_set_chord(15, midi, make_chord(/*D*/4, /*Minor*/0x07), "set_chord_name Dm (best-effort 7th)"); break;
        case 16: emit_set_chord(16, midi, make_chord(/*G*/7, /*Major*/0x01), "set_chord_name G (best-effort dom7)");  break;
        case 17: emit_set_chord(17, midi, make_chord(/*F*/6, /*Minor*/0x07), "set_chord_name F# dim (best-effort)");  break;
        case 18: {
            auto c = make_chord(/*C*/3, /*Maj7*/0x03, /*bass E*/5, /*bass type*/0);
            emit_set_chord(18, midi, c, "set_chord_name CMaj7/E (bass override)");
        } break;

        /* ============================================================
         * §5.2 Flex Data 0x01 (Metadata Text)
         * ============================================================ */
        case 19: emit_flex_text(19, midi, kFlexBankMetadata, kFlexProjectName,      "Demo Project",      "metadata project_name");      break;
        case 20: emit_flex_text(20, midi, kFlexBankMetadata, kFlexCompositionName,  "Test Song",         "metadata composition_name");  break;
        case 21: emit_flex_text(21, midi, kFlexBankMetadata, kFlexMidiClipName,     "Clip 1",            "metadata midi_clip_name");    break;
        case 22: emit_flex_text(22, midi, kFlexBankMetadata, kFlexCopyright,        "(c) 2026 Bench",    "metadata copyright");         break;
        case 23: emit_flex_text(23, midi, kFlexBankMetadata, kFlexComposer,         "Test User",         "metadata composer");          break;
        case 24: emit_flex_text(24, midi, kFlexBankMetadata, kFlexLyricist,         "Test User",         "metadata lyricist");          break;
        case 25: emit_flex_text(25, midi, kFlexBankMetadata, kFlexArranger,         "Bench",             "metadata arranger");          break;
        case 26: emit_flex_text(26, midi, kFlexBankMetadata, kFlexPublisher,        "Bench",             "metadata publisher");         break;
        case 27: emit_flex_text(27, midi, kFlexBankMetadata, kFlexPrimaryPerformer, "Bench",             "metadata primary_performer"); break;
        case 28: emit_flex_text(28, midi, kFlexBankMetadata, kFlexProjectName,
                                "Long Project Name That Spans Multiple UMP Packets For Testing",
                                "metadata project_name (multi-packet)"); break;
        case 29: emit_flex_text(29, midi, kFlexBankMetadata, kFlexComposer,
                                "Compositor Nao Existente Com Acentuacao Em UTF8",
                                "metadata composer (multi-packet UTF-8)"); break;

        /* ============================================================
         * §5.3 Flex Data 0x02 (Performance Text)
         * ============================================================ */
        case 30: emit_flex_text(30, midi, kFlexBankPerfText, kFlexLyrics,         "La la la",         "perf lyrics");          break;
        case 31: emit_flex_text(31, midi, kFlexBankPerfText, kFlexLyricsLanguage, "en-US",            "perf lyrics_language"); break;
        case 32: emit_flex_text(32, midi, kFlexBankPerfText, kFlexRuby,           "(test ruby)",      "perf ruby");            break;
        case 33: emit_flex_text(33, midi, kFlexBankPerfText, kFlexLyrics,
                                "Letra de teste com conteudo razoavelmente longo para multipacket",
                                "perf lyrics (multi-packet)"); break;
        case 34: emit_flex_text(34, midi, kFlexBankPerfText, kFlexComment,       "Bench note",       "perf comment");         break;

