sauloverissimo/midi2_cpp/examples/ump-test-bench-rp2040/src/catalog.cpp
        /* ============================================================
         * §5.4 MIDI 2.0 Channel Voice (mt 0x4)
         * ============================================================ */
        case 35: emit_note_on2 (35, midi, 60, 0x8000, "note_on n=60 vel=0x8000");      break;
        case 36: emit_note_off2(36, midi, 60, 0x0000, "note_off n=60");                break;
        case 37: emit_note_on2 (37, midi, 64, 0xFFFF, "note_on n=64 vel=0xFFFF max");  break;
        case 38: emit_note_off2(38, midi, 64, 0x0000, "note_off n=64");                break;
        case 39: emit_note_on2 (39, midi, 67, 0x4000, "note_on n=67 vel=0x4000");      break;
        case 40: emit_note_off2(40, midi, 67, 0x0000, "note_off n=67");                break;
        case 41: {
            midi.sendPolyPressure(kCatalogGroup, kCatalogChannel, 60, 0x80000000u);
            uint32_t w[4]; midi2_msg_poly_pressure(w, kCatalogGroup, kCatalogChannel, 60, 0x80000000u);
            log_words(41, "poly_pressure n=60 val=0x80000000", w, 2);
        } break;
        case 42: {
            midi.sendChannelPressure(kCatalogGroup, kCatalogChannel, 0x40000000u);
            uint32_t w[4]; midi2_msg_chan_pressure(w, kCatalogGroup, kCatalogChannel, 0x40000000u);
            log_words(42, "channel_pressure val=0x40000000", w, 2);
        } break;
        case 43: emit_pitchbend2(43, midi, 0x80000000u, "pitch_bend val=0x80000000 center"); break;
        case 44: emit_pitchbend2(44, midi, 0xFFFFFFFFu, "pitch_bend val=0xFFFFFFFF max");    break;
        case 45: emit_pitchbend2(45, midi, 0x00000000u, "pitch_bend val=0x00000000 min");    break;
        case 46: emit_cc2(46, midi,  1, 0x80000000u, "cc cc=1 mod_wheel val=0x80000000"); break;
        case 47: emit_cc2(47, midi,  7, 0xC0000000u, "cc cc=7 volume val=0xC0000000");   break;
        case 48: emit_cc2(48, midi, 64, 0xFFFFFFFFu, "cc cc=64 sustain val=0xFFFFFFFF"); break;
        case 49: {
            midi.sendProgram(kCatalogGroup, kCatalogChannel, /*program*/ 5,
                             /*bank_msb*/ 0, /*bank_lsb*/ 0, /*bank_valid*/ true);
            uint32_t w[4]; midi2_msg_program(w, kCatalogGroup, kCatalogChannel,
                                              5, /*bank_valid*/ true, 0, 0);
            log_words(49, "program prog=5 bank_msb=0 bank_lsb=0", w, 2);
        } break;
        case 50: {
            midi.sendPerNotePitchBend(kCatalogGroup, kCatalogChannel, 60, 0x80000000u);
            uint32_t w[4]; midi2_msg_per_note_pb(w, kCatalogGroup, kCatalogChannel, 60, 0x80000000u);
            log_words(50, "per_note_pitch_bend n=60 val=0x80000000", w, 2);
        } break;
        case 51: {
            midi.sendPerNotePitchBend(kCatalogGroup, kCatalogChannel, 60, 0xC0000000u);
            uint32_t w[4]; midi2_msg_per_note_pb(w, kCatalogGroup, kCatalogChannel, 60, 0xC0000000u);
            log_words(51, "per_note_pitch_bend n=60 val=0xC0000000", w, 2);
        } break;
        case 52: {
            midi.sendPerNoteManagement(kCatalogGroup, kCatalogChannel, 60,
                                       /*detach*/ true, /*reset*/ true);
            uint32_t w[4]; midi2_msg_per_note_mgmt(w, kCatalogGroup, kCatalogChannel,
                                                    60, /*detach*/ true, /*reset*/ true);
            log_words(52, "per_note_mgmt n=60 detach=1 reset=1", w, 2);
        } break;
        case 53: {
            midi.sendRegPerNoteController(kCatalogGroup, kCatalogChannel, 60, 7, 0x80000000u);
            uint32_t w[4]; midi2_msg_reg_per_note_ctrl(w, kCatalogGroup, kCatalogChannel,
                                                        60, 7, 0x80000000u);
            log_words(53, "reg_per_note_ctrl n=60 idx=7 val=0x80000000", w, 2);
        } break;
        case 54: {
            midi.sendAsnPerNoteController(kCatalogGroup, kCatalogChannel, 60, 12, 0x80000000u);
            uint32_t w[4]; midi2_msg_asn_per_note_ctrl(w, kCatalogGroup, kCatalogChannel,
                                                        60, 12, 0x80000000u);
            log_words(54, "asn_per_note_ctrl n=60 idx=12 val=0x80000000", w, 2);
        } break;
        case 55: {
            midi.sendRpn(kCatalogGroup, kCatalogChannel, 0, 0, 0x10000000u);
            uint32_t w[4]; midi2_msg_rpn(w, kCatalogGroup, kCatalogChannel, 0, 0, 0x10000000u);
            log_words(55, "rpn bank=0 idx=0 val=0x10000000", w, 2);
        } break;
        case 56: {
            midi.sendNrpn(kCatalogGroup, kCatalogChannel, 1, 5, 0x20000000u);
            uint32_t w[4]; midi2_msg_nrpn(w, kCatalogGroup, kCatalogChannel, 1, 5, 0x20000000u);
            log_words(56, "nrpn bank=1 idx=5 val=0x20000000", w, 2);
        } break;
        case 57: {
            midi.sendRelRpn(kCatalogGroup, kCatalogChannel, 0, 0, 0x00000010);
            uint32_t w[4]; midi2_msg_rel_rpn(w, kCatalogGroup, kCatalogChannel,
                                              0, 0, 0x00000010u);
            log_words(57, "rel_rpn bank=0 idx=0 delta=+0x10", w, 2);
        } break;
        case 58: {
            midi.sendRelNrpn(kCatalogGroup, kCatalogChannel, 1, 5, (int32_t)0xFFFFFFF0);
            uint32_t w[4]; midi2_msg_rel_nrpn(w, kCatalogGroup, kCatalogChannel,
                                               1, 5, 0xFFFFFFF0u);
            log_words(58, "rel_nrpn bank=1 idx=5 delta=-0x10", w, 2);
        } break;

        /* ============================================================
         * §5.5 MIDI 1.0 Channel Voice (mt 0x2)
         * ============================================================ */
        case 59: {
            midi.sendNoteOn1(kCatalogGroup, kCatalogChannel, 60, 0x40);
            log_word1(59, "midi1 note_on n=60 vel=0x40",
                      ((uint32_t)0x2 << 28) | ((uint32_t)kCatalogGroup << 24)
                      | ((uint32_t)0x90 << 16) | ((uint32_t)60 << 8)  | 0x40);
        } break;
        case 60: {
            midi.sendNoteOff1(kCatalogGroup, kCatalogChannel, 60, 0x00);
            log_word1(60, "midi1 note_off n=60 vel=0x00",
                      ((uint32_t)0x2 << 28) | ((uint32_t)kCatalogGroup << 24)
                      | ((uint32_t)0x80 << 16) | ((uint32_t)60 << 8)  | 0x00);
        } break;
        case 61: {
            midi.sendCC1(kCatalogGroup, kCatalogChannel, 7, 0x60);
            log_word1(61, "midi1 cc cc=7 val=0x60",
                      ((uint32_t)0x2 << 28) | ((uint32_t)kCatalogGroup << 24)
                      | ((uint32_t)0xB0 << 16) | ((uint32_t)7 << 8)   | 0x60);
        } break;
        case 62: {
            const uint16_t v14 = 0x2000u;  // LSB=0x00 MSB=0x40
            midi.sendPitchBend1(kCatalogGroup, kCatalogChannel, v14);
            log_word1(62, "midi1 pitch_bend center 0x2000",
                      ((uint32_t)0x2 << 28) | ((uint32_t)kCatalogGroup << 24)
                      | ((uint32_t)0xE0 << 16) | ((uint32_t)(v14 & 0x7F) << 8)
                      | ((v14 >> 7) & 0x7F));
        } break;
        case 63: {
            midi.sendProgram1(kCatalogGroup, kCatalogChannel, 5);
            log_word1(63, "midi1 program prog=5",
                      ((uint32_t)0x2 << 28) | ((uint32_t)kCatalogGroup << 24)
                      | ((uint32_t)0xC0 << 16) | ((uint32_t)5 << 8));
        } break;

        /* ============================================================
         * §5.6 System Common / Real-Time (mt 0x1)
         * ============================================================ */
        case 64: {
            // Timing Clock x24 in sequence (1 quarter @ 24 ppqn).
            uint32_t w0 = midi2_msg_system_timing_clock(kCatalogGroup);
            for (uint8_t k = 0; k < 24; ++k) {
                midi.sendClock(kCatalogGroup);
                log_word1(64, "system timing_clock (1 of 24)", w0);
            }
        } break;
        case 65: {
            midi.sendStart(kCatalogGroup);
            log_word1(65, "system start", midi2_msg_system_start(kCatalogGroup));
        } break;
        case 66: {
            midi.sendContinue(kCatalogGroup);
            log_word1(66, "system continue", midi2_msg_system_continue(kCatalogGroup));
        } break;
        case 67: {
            midi.sendStop(kCatalogGroup);
            log_word1(67, "system stop", midi2_msg_system_stop(kCatalogGroup));
        } break;
        case 68: {
            const uint8_t time_code = 0x05;  // type=0, value=0x05
            midi.sendMTC(kCatalogGroup, time_code);
            log_word1(68, "system mtc qframe time_code=0x05",
                      midi2_msg_system_mtc(kCatalogGroup, time_code));
        } break;
        case 69: {
            const uint16_t pos14 = 0x0010u;
            midi.sendSongPosition(kCatalogGroup, pos14);
            log_word1(69, "system song_position 14b=0x0010",
                      midi2_msg_system_song_position(kCatalogGroup, pos14));
        } break;
        case 70: {
            midi.sendSongSelect(kCatalogGroup, 3);
            log_word1(70, "system song_select song=3",
                      midi2_msg_system_song_select(kCatalogGroup, 3));
        } break;
        case 71: {
            midi.sendTuneRequest(kCatalogGroup);
            log_word1(71, "system tune_request",
                      midi2_msg_system_tune_request(kCatalogGroup));
        } break;
        case 72: {
            midi.sendActiveSensing(kCatalogGroup);
            log_word1(72, "system active_sensing",
                      midi2_msg_system_active_sensing(kCatalogGroup));
        } break;
        case 73: {
            midi.sendSystemReset(kCatalogGroup);
            log_word1(73, "system reset",
                      midi2_msg_system_reset(kCatalogGroup));
        } break;

        /* ============================================================
         * §5.7 Data Messages (SysEx7 mt 0x3, SysEx8 mt 0x5)
         *
         * For SysEx7 we use pumpRaw + builder to control the packet
         * boundaries exactly (the midi.sendSysEx7 helper would emit a
         * Complete-form by default, but the spec asks for explicit
         * Start/Continue/End packets).
         * ============================================================ */
        case 74: {
            const uint8_t data[] = {'H', 'e', 'l', 'l', 'o', '!'};
            midi.sendSysEx7(kCatalogGroup, data, sizeof(data));
            uint32_t w[4] = {0,0,0,0};
            midi2_msg_sysex7_packet(w, kCatalogGroup, /*Complete*/ 0x00, data, sizeof(data));
            log_words(74, "sysex7 complete 'Hello!'", w, 2);
        } break;
        case 75: {
            const uint8_t data[] = {'H', 'e', 'l', 'l', 'o', ' '};
            emit_sysex7_one(75, midi, /*Start*/ 0x10, data, sizeof(data),
                            "sysex7 start 'Hello '");
        } break;
        case 76: {
            const uint8_t data[] = {'W', 'o', 'r', 'l', 'd', ' '};
            emit_sysex7_one(76, midi, /*Continue*/ 0x20, data, sizeof(data),
                            "sysex7 continue 'World '");
        } break;
        case 77: {
            const uint8_t data[] = {'D', 'o', 'n', 'e'};
            emit_sysex7_one(77, midi, /*End*/ 0x30, data, sizeof(data),
                            "sysex7 end 'Done'");
        } break;
        case 78: {
            const uint8_t data[] = {'H', 'e', 'l', 'l', 'o', ' ', 'U', 'M', 'P', ' ', '8', '!'};
            // 12 data bytes; midi.sendSysEx8 fragments if needed but 12 fits.
            midi.sendSysEx8(kCatalogGroup, /*streamId*/ 1, data, sizeof(data));
            uint32_t w[4];
            midi2_msg_sysex8_packet(w, kCatalogGroup, /*Complete*/ 0x00, /*streamId*/ 1,
                                     data, sizeof(data));
            log_words(78, "sysex8 complete 'Hello UMP 8!'", w, 4);
        } break;
        case 79: {
            const uint8_t data[13] = {'A','B','C','D','E','F','G','H','I','J','K','L','M'};
            emit_sysex8_one(79, midi, /*Start*/ 0x10, /*streamId*/ 1, data, sizeof(data),
                            "sysex8 start 13 bytes A..M");
        } break;
        case 80: {
            const uint8_t data[13] = {'N','O','P','Q','R','S','T','U','V','W','X','Y','Z'};
            emit_sysex8_one(80, midi, /*Continue*/ 0x20, /*streamId*/ 1, data, sizeof(data),
                            "sysex8 continue 13 bytes N..Z");
        } break;
        case 81: {
            const uint8_t data[13] = {'0','1','2','3','4','5','6','7','8','9','!','?','.'};
            emit_sysex8_one(81, midi, /*End*/ 0x30, /*streamId*/ 1, data, sizeof(data),
                            "sysex8 end 13 bytes digits");
        } break;

        /* ============================================================
         * §5.8 UMP Stream (mt 0xF)
         * ============================================================ */
        case 82: {
            // Endpoint Discovery is normally a HOST request; the bench
            // emits one for monitor-side coverage via pumpRaw.
            uint32_t w[4];
            midi2_msg_stream_endpoint_discovery(w, /*ump_ver_major*/ 1,
                                                 /*ump_ver_minor*/ 1,
                                                 /*filter*/ 0xFF);
            rp2040_midi2::pumpRaw(w, 4);
            log_words(82, "stream endpoint_discovery filter=0xFF", w, 4);
        } break;
        case 83: {
            midi.sendEndpointInfo(/*ump_ver_major*/ 1, /*minor*/ 1,
                                  /*static_fb*/ true, /*num_fb*/ 1,
                                  /*midi2*/ true, /*midi1*/ true,
                                  /*rx_jr*/ false, /*tx_jr*/ true);
            uint32_t w[4];
            midi2_msg_stream_endpoint_info(w, 1, 1, true, 1, true, true, false, true);
            log_words(83, "stream endpoint_info v1.1 midi1+midi2 tx_jr", w, 4);
        } break;
        case 84: {
            midi.sendDeviceIdentity(kBenchMfrId, kBenchFamily, kBenchModel, kBenchVersion);
            uint32_t w[4];
            const uint32_t mfr24 = ((uint32_t)kBenchMfrId[0] << 16)
                                  | ((uint32_t)kBenchMfrId[1] << 8)
                                  |  (uint32_t)kBenchMfrId[2];
            midi2_msg_stream_device_identity(w, mfr24, kBenchFamily, kBenchModel, kBenchVersion);
            log_words(84, "stream device_identity bench", w, 4);
        } break;
        case 85: {
            midi.sendEndpointNameUpdate(kBenchEndpoint);
            emit_endpoint_name_text(85, kBenchEndpoint, "stream endpoint_name");
        } break;
        case 86: {
            midi.sendProductInstanceIdUpdate(kBenchProductInst);
            emit_product_id_text(86, kBenchProductInst, "stream product_instance_id");
        } break;
        case 87: {
            // Stream Configuration Request, no midi2_cpp sender (host-side message).
            uint32_t w[4]; midi2_msg_stream_config_request(w, /*protocol*/ 0x02);
            rp2040_midi2::pumpRaw(w, 4);
            log_words(87, "stream config_request protocol=2", w, 4);
        } break;
        case 88: {
            midi.sendStreamConfigNotify(/*protocol*/ 0x02);
            uint32_t w[4]; midi2_msg_stream_config_notify(w, /*protocol*/ 0x02);
            log_words(88, "stream config_notify protocol=2", w, 4);
        } break;
        case 89: {
            // FB Discovery, no midi2_cpp sender (host-side message).
            uint32_t w[4]; midi2_msg_stream_fb_discovery(w, /*fb_num*/ 0xFF, /*filter*/ 0xFF);
            rp2040_midi2::pumpRaw(w, 4);
            log_words(89, "stream fb_discovery fb=0xFF filter=0xFF", w, 4);
        } break;
        case 90: {
            midi.sendFbInfo(/*active*/ true, /*fb_num*/ 0, /*direction*/ 0x03,
                            /*first_group*/ 0, /*num_groups*/ 1,
                            /*midi_ci_ver*/ 0x02, /*sysex8*/ false,
                            /*protocol*/ 0x02);
            uint32_t w[4];
            midi2_msg_stream_fb_info(w, true, 0, 0x03, 0, 1, 0x02, false, 0x02);
            log_words(90, "stream fb_info fb=0 bidir grp0..0", w, 4);
        } break;
        case 91: {
            midi.sendFbNameUpdate(0, kBenchFbName);
            emit_fb_name_text(91, /*fb_num*/ 0, kBenchFbName, "stream fb_name");
        } break;
        case 92: {
            midi.sendStartOfClip();
            uint32_t w[4]; midi2_msg_stream_start_of_clip(w);
            log_words(92, "stream start_of_clip", w, 4);
        } break;
        case 93: {
            midi.sendEndOfClip();
            uint32_t w[4]; midi2_msg_stream_end_of_clip(w);
            log_words(93, "stream end_of_clip", w, 4);
        } break;

        /* ============================================================
         * §5.9 Utility (mt 0x0)
         * ============================================================ */
        case 94: {
            midi.sendNoop(kCatalogGroup);
            log_word1(94, "utility noop",
                      ((uint32_t)0x0 << 28) | ((uint32_t)kCatalogGroup << 24));
        } break;
        case 95: {
            midi.sendJRClock(kCatalogGroup, 0x4000);
            log_word1(95, "utility jr_clock ts=0x4000",
                      midi2_msg_jr_clock(kCatalogGroup, 0x4000));
        } break;
        case 96: {
            midi.sendJRTimestamp(kCatalogGroup, 0x2000);
            log_word1(96, "utility jr_timestamp ts=0x2000",
                      midi2_msg_jr_timestamp(kCatalogGroup, 0x2000));
        } break;
        case 97: {
            midi.sendDctpq(480);
            log_word1(97, "utility dctpq tpq=480", midi2_msg_dctpq(480));
        } break;
        case 98: {
            midi.sendDeltaClockstamp(240);
            log_word1(98, "utility delta_clockstamp ticks=240",
                      midi2_msg_delta_clockstamp(240));
        } break;

        /* ============================================================
         * §5.10 Edge cases
         * ============================================================ */
        case 99: {
            // Set Tempo BPM=120 with bit 31 of word2 set (reserved bits).
            uint32_t w[4];
            midi2_msg_tempo(w, kCatalogGroup, /*ten_ns*/ 50000000u);
            w[2] |= (UINT32_C(1) << 31);
            rp2040_midi2::pumpRaw(w, 4);
            log_words(99, "edge: set_tempo with reserved bit set", w, 4);
        } break;
        case 100: {
            // Flex Data bank 0x00 with status 0x42 (unassigned in M2-104 v1.1.2).
            uint32_t w[4] = {0, 0, 0, 0};
            w[0] = ((uint32_t)0xD << 28)             // mt 0xD
                 | ((uint32_t)kCatalogGroup << 24)
                 | ((uint32_t)0x00 << 22)            // form 0
                 | ((uint32_t)0x01 << 20)            // address group-level
                 | ((uint32_t)0x00 << 16)            // channel 0
                 | ((uint32_t)0x00 << 8)             // statusBank 0x00
                 |  (uint32_t)0x42;                  // status 0x42 (unassigned)
            rp2040_midi2::pumpRaw(w, 4);
            log_words(100, "edge: flex_data bank=0x00 status=0x42", w, 4);
        } break;

        default:
            emit_stub(idx);
            break;
    }
    return true;
}

void catalogEmitAll(midi2::m2device& midi, uint32_t tx_pause_ms) {
    for (uint8_t i = 0; i < kCatalogSize; ++i) {
        catalogEmit(i, midi);
        if (tx_pause_ms > 0) sleep_ms(tx_pause_ms);
    }
}

}  // namespace ump_test_bench
